burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_exti.c
/*!
    \brief      clear EXTI line x interrupt pending flag (API_ID(0x000FU))
    \param[in]  linex: EXTI line number
                only one parameter can be selected which is shown as below:
      \arg        EXTI_0: EXTI line 0
      \arg        EXTI_1: EXTI line 1
      \arg        EXTI_2: EXTI line 2
      \arg        EXTI_3: EXTI line 3
      \arg        EXTI_4: EXTI line 4
      \arg        EXTI_5: EXTI line 5
      \arg        EXTI_6: EXTI line 6
      \arg        EXTI_7: EXTI line 7
      \arg        EXTI_8: EXTI line 8
      \arg        EXTI_9: EXTI line 9
      \arg        EXTI_10: EXTI line 10
      \arg        EXTI_11: EXTI line 11
      \arg        EXTI_12: EXTI line 12
      \arg        EXTI_13: EXTI line 13
      \arg        EXTI_14: EXTI line 14
      \arg        EXTI_15: EXTI line 15
      \arg        EXTI_16: EXTI line 16
      \arg        EXTI_17: EXTI line 17
      \arg        EXTI_18: EXTI line 18
      \arg        EXTI_19: EXTI line 19
      \arg        EXTI_20: EXTI line 20 (only for GD32W515)
      \arg        EXTI_21: EXTI line 21
      \arg        EXTI_22: EXTI line 22
      \arg        EXTI_23: EXTI line 23
      \arg        EXTI_24: EXTI line 24
      \arg        EXTI_25: EXTI line 25
      \arg        EXTI_26: EXTI line 26
      \arg        EXTI_27: EXTI line 27
      \arg        EXTI_28: EXTI line 28
      \arg        EXTI_29: EXTI line 29 (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void exti_flag_clear(exti_line_enum linex)
{
    EXTI_PD = (uint32_t)linex;
}

/*!
    \brief      get EXTI line x interrupt pending flag (API_ID(0x0010U))
    \param[in]  linex: EXTI line number
                only one parameter can be selected which is shown as below:
      \arg        EXTI_0: EXTI line 0
      \arg        EXTI_1: EXTI line 1
      \arg        EXTI_2: EXTI line 2
      \arg        EXTI_3: EXTI line 3
      \arg        EXTI_4: EXTI line 4
      \arg        EXTI_5: EXTI line 5
      \arg        EXTI_6: EXTI line 6
      \arg        EXTI_7: EXTI line 7
      \arg        EXTI_8: EXTI line 8
      \arg        EXTI_9: EXTI line 9
      \arg        EXTI_10: EXTI line 10
      \arg        EXTI_11: EXTI line 11
      \arg        EXTI_12: EXTI line 12
      \arg        EXTI_13: EXTI line 13
      \arg        EXTI_14: EXTI line 14
      \arg        EXTI_15: EXTI line 15
      \arg        EXTI_16: EXTI line 16
      \arg        EXTI_17: EXTI line 17
      \arg        EXTI_18: EXTI line 18
      \arg        EXTI_19: EXTI line 19
      \arg        EXTI_20: EXTI line 20 (only for GD32W515)
      \arg        EXTI_21: EXTI line 21
      \arg        EXTI_22: EXTI line 22
      \arg        EXTI_23: EXTI line 23
      \arg        EXTI_24: EXTI line 24
      \arg        EXTI_25: EXTI line 25
      \arg        EXTI_26: EXTI line 26
      \arg        EXTI_27: EXTI line 27
      \arg        EXTI_28: EXTI line 28
      \arg        EXTI_29: EXTI line 29 (only for GD32F5HC)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus exti_interrupt_flag_get(exti_line_enum linex)
{
    FlagStatus reval = RESET;
    uint32_t flag_status = 0U;
    uint32_t interrupt_enable = 0U;
    
    flag_status = EXTI_PD & (uint32_t)linex;
    interrupt_enable = EXTI_INTEN & (uint32_t)linex;
    
    if((RESET != flag_status) && (RESET != interrupt_enable)) {
        reval = SET;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    
    return reval;
}

/*!
    \brief      clear EXTI line x interrupt pending flag (API_ID(0x0011U))
    \param[in]  linex: EXTI line number
                only one parameter can be selected which is shown as below:
      \arg        EXTI_0: EXTI line 0
      \arg        EXTI_1: EXTI line 1
      \arg        EXTI_2: EXTI line 2
      \arg        EXTI_3: EXTI line 3
      \arg        EXTI_4: EXTI line 4
      \arg        EXTI_5: EXTI line 5
      \arg        EXTI_6: EXTI line 6
      \arg        EXTI_7: EXTI line 7
      \arg        EXTI_8: EXTI line 8
      \arg        EXTI_9: EXTI line 9
      \arg        EXTI_10: EXTI line 10
      \arg        EXTI_11: EXTI line 11
      \arg        EXTI_12: EXTI line 12
      \arg        EXTI_13: EXTI line 13
      \arg        EXTI_14: EXTI line 14
      \arg        EXTI_15: EXTI line 15
      \arg        EXTI_16: EXTI line 16
      \arg        EXTI_17: EXTI line 17
      \arg        EXTI_18: EXTI line 18
      \arg        EXTI_19: EXTI line 19
      \arg        EXTI_20: EXTI line 20 (only for GD32W515)
      \arg        EXTI_21: EXTI line 21
      \arg        EXTI_22: EXTI line 22
      \arg        EXTI_23: EXTI line 23
      \arg        EXTI_24: EXTI line 24
      \arg        EXTI_25: EXTI line 25
      \arg        EXTI_26: EXTI line 26
      \arg        EXTI_27: EXTI line 27
      \arg        EXTI_28: EXTI line 28
      \arg        EXTI_29: EXTI line 29 (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void exti_interrupt_flag_clear(exti_line_enum linex)
{
    EXTI_PD = (uint32_t)linex;
}
